In [1]:
import pandas as pd

In [2]:
A = {"Name":['A','B','C','D','A','C'],"ENG":[8,7,6,3,8,5],"HIN":[6,9,7,5,6,3]}

In [3]:
data = pd.DataFrame(A)

In [4]:
data

  Name  ENG  HIN
0    A    8    6
1    B    7    9
2    C    6    7
3    D    3    5
4    A    8    6
5    C    5    3

In [9]:
data['Duplicate'] = data.duplicated()
data

  Name  ENG  HIN  duplicate  Duplicate
0    A    8    6      False      False
1    B    7    9      False      False
2    C    6    7      False      False
3    D    3    5      False      False
4    A    8    6      False       True
5    C    5    3      False      False

In [14]:
data.drop(columns=['duplicate','Duplicate'],inplace = True)

data

  Name  ENG  HIN
0    A    8    6
1    B    7    9
2    C    6    7
3    D    3    5
4    A    8    6
5    C    5    3

In [16]:
data.drop_duplicates(inplace=True)

In [17]:
data

  Name  ENG  HIN
0    A    8    6
1    B    7    9
2    C    6    7
3    D    3    5
5    C    5    3

In [18]:
df = pd.read_csv('loan.csv')

In [19]:
df.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [22]:
df.shape

(614, 13)

In [23]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
609    False
610    False
611    False
612    False
613    False
Length: 614, dtype: bool

In [24]:
df.drop_duplicates(inplace=True)

In [25]:
df.shape

(614, 13)

In [26]:
# No Duplicate data is here